{
  "main": {
    "name": "Lee M. Raulin",
    "description": "Web developer specializing in JavaScript (React, Node, Express) and Python. I use code to solve problems.",
    "image": "profilepic.jpg",
    "bio": [
      "After a previous life as an English teacher in Korea, a stint in the Coast Guard, and an Master's in psychology, I finally found my calling as a programmer.",
      "It began with using mods for Oblivion, when I discovered I found the process of troublshooting addictive. From there, I began using Linux as my primary OS, and the rest is history. In the last several years, I have been delighted to discover that I can use my skills to solve real problems in the worlds of business and government.",
      "I'm confident I could build a REST API in any language at this point, but JavaScript (React, Express, Node...any database) is where I am most comfortable. Eric Elliot, Douglas Crockford, and Kyle Simpson convinced me that it is not only as good as any general-purpose programming language for most purposes; it is almost beautiful in its own way.",
      "Python was my first language, and still second favorite. I'm also pretty handy with Bash, and recieved 3 months of formal training each in C# and Java.",
      "My personality could be described as dopaminergic. My brain is ravenous and restless. I've sometimes felt as if I want to devour the world.",
      "I am fascinated by psychology and neuroscience, especially their practical relevance for self-understanding and better living. I keep my body and brain and healthy with light hygeine, self-generated optic flow (ie walking and running), calisthenics, club swinging, yoga, breathwork, and daily ice baths in the Chesapeake Bay."
    ],
    "contactMessage": "Get in touch!",
    "email": "leeraulin@gmail.com",
    "phone": "(443) 684-8939",
    "github": "https://github.com/lraulin",
    "project": "https://github.com/nordicgiant2/react-nice-resume",
    "address": {
      "street": "",
      "city": "Chesapeake Beach",
      "state": "Maryland",
      "zip": ""
    },
    "website": "",
    "resumeDownload": "https://www.dropbox.com/s/ngrqu4udpblvatn/Lee_Raulin_Resume.PDF?dl=0",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/leeraulin/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "instagram",
        "url": "http://instagram.com/tbaker_x",
        "className": "fa fa-instagram"
      },
      {
        "name": "github",
        "url": "https://github.com/lraulin",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "",
    "education": [
      {
        "school": "Northcentral University",
        "degree": "Masters in Psychology",
        "graduated": "November 2013",
        "description": "Describe your experience at school, what you learned, what useful skills you have acquired etc."
      },
      {
        "school": "St. Mary's College of Maryland",
        "degree": "Batchelors in Psychology",
        "graduated": "June 2004",
        "description": "Describe your experience at school, what you learned, what useful skills you have acquired etc."
      }
    ],
    "work": [
      {
        "company": "Snapnurse",
        "title": "Booker",
        "years": "November 2020 - Present",
        "description": "Doing my part during COVID by helping nurses on the front lines get paid. Although my official job is approving timesheets, my programming skills have been in high demand. I created a React/Python/Flask webapp to help my team calculate holiday pay adjustments and to identify timecards needing admin approval. It is used by myself and several of my coworkers to speed our work on a daily basis. I have been developing my Pandas skills to perform data cleaning on spreadsheets. And I created my own React front end that uses's the company's backend API, in order to prototype UI enhancements that will save time and reduce errors for my team."
      },
      {
        "company": "Smoothstack",
        "title": "Software Engineer",
        "years": "December 2019 - September 2020",
        "description": "Trained in developing microservices with Java Spring Boot, React/Angular, CI/CD with Jenkins. Furloughed due to COVID."
      },

      {
        "company": "Workforce Opportunity Services (contractor at US Department of Transportation)",
        "title": "Full Stack Web Developer",
        "years": "September 2018 - September 2019",
        "description": ""
      }
    ],
    "skills": [
      { "name": "Python", "level": "60%" },
      { "name": "ReactJs", "level": "60%" },
      { "name": "JAVA", "level": "40%" },
      { "name": "C#", "level": "40%" }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Canadian Wanderlust",
        "category": "My Travel Blog for my post-university travels",
        "image": "canadian-wanderlust.jpg",
        "url": "https://www.canadianwanderlust.com"
      },
      {
        "title": "Fury Fighting Gear",
        "category": "(offline now) A fighting gear company I started",
        "image": "fury-fighting-gear.jpg",
        "url": "http://www.timbakerdev.com"
      },
      {
        "title": "Original Thai Food",
        "category": "Website I built for a restaurant I like in Thailand",
        "image": "original-thai-food.jpg",
        "url": "http://www.timbakerdev.com/originalthaifood.github.io"
      },
      {
        "title": "Resume Website",
        "category": "A React based resume website template",
        "image": "resume-website.jpg",
        "url": "http://www.timbakerdev.com"
      },
      {
        "title": "Smirkspace",
        "category": "(MVP Only) A React and Meteor based chat University project.",
        "image": "smirkspace.jpg",
        "url": "http://www.smirkspace.com"
      }
    ]
  }
}
